ssenja/TMM737/BSP/GD32H7xx_HAL/SRC/gd32h73x_75x_timer.c
    /* configure the counter direction and aligned mode */
    if((TIMER0  == timer_periph) || (TIMER7  == timer_periph) || (TIMER1  == timer_periph) || (TIMER2  == timer_periph) || \
            (TIMER3  == timer_periph) || (TIMER4  == timer_periph) || (TIMER22 == timer_periph) || (TIMER23 == timer_periph) || \
            (TIMER30 == timer_periph) || (TIMER31 == timer_periph)) {
        TIMER_CTL0(timer_periph) &= (~(uint32_t)(TIMER_CTL0_DIR | TIMER_CTL0_CAM));
        TIMER_CTL0(timer_periph) |= (uint32_t)(initpara->alignedmode & ALIGNEDMODE_MASK);
        TIMER_CTL0(timer_periph) |= (uint32_t)(initpara->counterdirection & COUNTERDIRECTION_MASK);
    }

    /* configure the autoreload value */
    if((TIMER50  == timer_periph) || (TIMER51  == timer_periph)) {
        TIMER_CARL(timer_periph) = (uint32_t)initpara->period;
        TIMER_CARH(timer_periph) = (uint32_t)(initpara->period >> 32U);
    } else {
        TIMER_CAR(timer_periph) = (uint32_t)initpara->period;
    }

    /* configure the clock division value */
    if((TIMER5 != timer_periph) && (TIMER6 != timer_periph) && (TIMER50 != timer_periph) && (TIMER51 != timer_periph)) {
        /* reset the CKDIV bit */
        TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_CKDIV);
        TIMER_CTL0(timer_periph) |= (uint32_t)(initpara->clockdivision & CLOCKDIVISION_MASK);
    }

    if((TIMER0  == timer_periph) || (TIMER7  == timer_periph) || (TIMER14 == timer_periph) || (TIMER15 == timer_periph) || \
            (TIMER16 == timer_periph) || (TIMER40 == timer_periph) || (TIMER41 == timer_periph) || (TIMER42 == timer_periph) || \
            (TIMER43 == timer_periph) || (TIMER44 == timer_periph)) {
        /* configure the repetition counter value */
        if(initpara->repetitioncounter <= 255U) {
            TIMER_CFG(timer_periph) &= (~(uint32_t)TIMER_CFG_CREPSEL);
            TIMER_CREP0(timer_periph) = (uint32_t)initpara->repetitioncounter;
        } else {
            TIMER_CFG(timer_periph) |= (uint32_t)TIMER_CFG_CREPSEL;
            TIMER_CREP1(timer_periph) = (uint32_t)initpara->repetitioncounter;
        }
    }

    /* generate an update event */
    TIMER_SWEVG(timer_periph) |= (uint32_t)TIMER_SWEVG_UPG;
}

/*!
    \brief      enable a TIMER
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,30,31,40~44,50,51)
    \param[out] none
    \retval     none
*/
void timer_enable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_CEN;
}

/*!
    \brief      disable a TIMER
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,30,31,40~44,50,51)
    \param[out] none
    \retval     none
*/
void timer_disable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_CEN);
}

/*!
    \brief      enable the auto reload shadow function
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,30,31,40~44,50,51)
    \param[out] none
    \retval     none
*/
void timer_auto_reload_shadow_enable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_ARSE;
}

/*!
    \brief      disable the auto reload shadow function
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,30,31,40~44,50,51)
    \param[out] none
    \retval     none
*/
void timer_auto_reload_shadow_disable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_ARSE);
}

/*!
    \brief      enable the update event
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,30,31,40~44,50,51)
    \param[out] none
    \retval     none
*/
void timer_update_event_enable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_UPDIS);
}

/*!
    \brief      disable the update event
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,30,31,40~44,50,51)
    \param[out] none
    \retval     none
*/
void timer_update_event_disable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) |= (uint32_t) TIMER_CTL0_UPDIS;
}

/*!
    \brief      set TIMER counter alignment mode
    \param[in]  timer_periph: TIMERx(x=0~4,7,22,23,30,31)
    \param[in]  aligned: center-aligned mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_COUNTER_EDGE: edge-aligned mode
      \arg        TIMER_COUNTER_CENTER_DOWN: center-aligned and counting down assert mode
      \arg        TIMER_COUNTER_CENTER_UP: center-aligned and counting up assert mode
      \arg        TIMER_COUNTER_CENTER_BOTH: center-aligned and counting up/down assert mode
    \param[out] none
    \retval     none
*/
void timer_counter_alignment(uint32_t timer_periph, uint16_t aligned)
{
    TIMER_CTL0(timer_periph) &= (uint32_t)(~TIMER_CTL0_CAM);
    TIMER_CTL0(timer_periph) |= (uint32_t)aligned;
}

/*!
    \brief      set TIMER counter up direction
    \param[in]  timer_periph: TIMERx(x=0~4,7,22,23,30,31)
    \param[out] none
    \retval     none
*/
void timer_counter_up_direction(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_DIR);
}

/*!
    \brief      set TIMER counter down direction
    \param[in]  timer_periph: TIMERx(x=0~4,7,22,23,30,31)
    \param[out] none
    \retval     none
*/
void timer_counter_down_direction(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_DIR;
}

/*!
    \brief      configure TIMER prescaler
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,30,31,40~44,50,51)
    \param[in]  prescaler: prescaler value, 0~0xFFFF
    \param[in]  pscreload: prescaler reload mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_PSC_RELOAD_NOW: the prescaler is loaded right now
      \arg        TIMER_PSC_RELOAD_UPDATE: the prescaler is loaded at the next update event
    \param[out] none
    \retval     none
*/
void timer_prescaler_config(uint32_t timer_periph, uint16_t prescaler, uint32_t pscreload)
{
    TIMER_PSC(timer_periph) = (uint32_t)prescaler;

    if(TIMER_PSC_RELOAD_NOW == pscreload) {
        TIMER_SWEVG(timer_periph) |= (uint32_t)TIMER_SWEVG_UPG;
    }
}

/*!
    \brief      configure TIMER repetition register value
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,40~44)
    \param[in]  ccsel: repetition register selection
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CREP0_ENABLE: The update event rate is depended to TIMERx_CREP0 register
      \arg        TIMER_CREP1_ENABLE: The update event rate is depended to TIMERx_CREP1 register
    \param[in]  repetition: the counter repetition value, 0~0xFF, use TIMER_CREP0 register,
                                                          0~0xFFFFFFFF, use TIMER_CREP1 register
    \param[out] none
    \retval     none
*/
void timer_repetition_value_config(uint32_t timer_periph, uint16_t ccsel, uint32_t repetition)
{
    if(TIMER_CREP0_ENABLE == ccsel) {
        TIMER_CFG(timer_periph) &= (~(uint32_t)TIMER_CFG_CREPSEL);
        TIMER_CREP0(timer_periph) = (uint32_t)repetition;
    } else if(TIMER_CREP1_ENABLE == ccsel) {
        TIMER_CFG(timer_periph) |= (uint32_t)TIMER_CFG_CREPSEL;
        TIMER_CREP1(timer_periph) = (uint32_t)repetition;
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      read TIMER runtime repetition register value
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,40~44)
    \param[out] none
    \retval     counter repetition value in TIMER_CREP1 register, 0~0xFFFFFFFF
*/
uint32_t timer_runtime_repetition_value_read(uint32_t timer_periph)
{
    return (TIMER_CREP1(timer_periph));
}

/*!
    \brief      configure TIMER autoreload register value
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,30,31,40~44,50,51)
    \param[in]  autoreload: the counter auto-reload value, 0~0xFFFF, TIMERx(x=0,2,3,7,14~16,30,31,40~44)
                                                           0~0xFFFFFFFF, TIMERx(x=1,4,5,6,22,23)
                                                           0~0xFFFFFFFFFFFFFFFF, TIMERx(x=50,51)
    \param[out] none
    \retval     none
*/
void timer_autoreload_value_config(uint32_t timer_periph, uint64_t autoreload)
{
    /* configure TIMER50/TIMER51 autoreload register value (64-bit) */
    if((TIMER50 == timer_periph) || (TIMER51 == timer_periph)) {
        TIMER_CARL(timer_periph) = (uint32_t)autoreload;
        TIMER_CARH(timer_periph) = (uint32_t)(autoreload >> 32U);
    } else {
        /* configure other TIMER autoreload register value (32-bit or 16-bit) */
        TIMER_CAR(timer_periph) = (uint32_t)autoreload;
    }
}

/*!
    \brief      get TIMER autoreload register value
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,30,31,40~44,50,51)
    \param[out] none
    \retval     counter auto reload register value, 0~0xFFFF, TIMERx(x=0,2,3,7,14~16,30,31,40~44)
                                                    0~0xFFFFFFFF, TIMERx(x=1,4,5,6,22,23)
                                                    0~0xFFFFFFFFFFFFFFFF, TIMERx(x=50,51)
*/
uint64_t timer_autoreload_value_read(uint32_t timer_periph)
{
    uint64_t autoreload = 0U;
    /* read TIMER50/TIMER51 autoreload register value (64-bit) */
    if((TIMER50 == timer_periph) || (TIMER51 == timer_periph)) {
        autoreload = (((uint64_t)TIMER_CARH(timer_periph)) << 32U);
        autoreload |= TIMER_CARL(timer_periph);
    } else {
        /* read other TIMER autoreload register value (32-bit or 16-bit) */
        autoreload =  TIMER_CAR(timer_periph);
    }
    return autoreload;
}

/*!
    \brief      configure TIMER counter register value
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,30,31,40~44,50,51)
    \param[in]  counter: the counter value, 0~0xFFFF, TIMERx(x=0,2,3,7,14~16,30,31,40~44)
                                            0~0xFFFFFFFF, TIMERx(x=1,4,5,6,22,23)
                                            0~0xFFFFFFFFFFFFFFFF, TIMERx(x=50,51)
    \param[out] none
    \retval     none
*/
void timer_counter_value_config(uint32_t timer_periph, uint64_t counter)
{
    /* configure TIMER50/TIMER51 counter value (64-bit) */
    if((TIMER50 == timer_periph) || (TIMER51 == timer_periph)) {
        TIMER_CNTL(timer_periph) = (uint32_t)counter;
        TIMER_CNTH(timer_periph) = (uint32_t)(counter >> 32U);
        if(TIMER_CTL0(timer_periph) & TIMER_CTL0_UPIFBUEN) {
            TIMER_CNTH(timer_periph) &= (~TIMER_CNT_UPIFBU_MASK);
        }
    } else {
        /* configure other TIMER counter value (32-bit or 16-bit) */
        if(TIMER_CTL0(timer_periph) & TIMER_CTL0_UPIFBUEN) {
            counter &= (~TIMER_CNT_UPIFBU_MASK);
        }
        TIMER_CNT(timer_periph) = (uint32_t)counter;
    }
}

/*!
    \brief      read TIMER counter value
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,30,31,40~44,50,51)
    \param[out] none
    \retval     counter value: 0~0xFFFF, TIMERx(x=0,2,3,7,14~16,30,31,40~44)
                               0~0xFFFFFFFF, TIMERx(x=1,4,5,6,22,23)
                               0~0xFFFFFFFFFFFFFFFF, TIMERx(x=50,51)
*/
uint64_t timer_counter_read(uint32_t timer_periph)
{
    uint64_t count_value = 0U;

